# Units

## Description
Procedure Units specifies a standard units setting for the active document. &lt;BR&gt;
&lt;BR&gt;
&lt;I&gt;Table - Standard Unit Settings&lt;/I&gt;&lt;P&gt;
&lt;CENTER&gt;
	&lt;TABLE BORDER=&quot;0&quot; ALIGN=&quot;CENTER&quot; CELLSPACING=&quot;1&quot; CELLPADDING=&quot;3&quot; ID=&quot;Table1&quot;&gt;
		&lt;TR&gt;
			&lt;TH ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#000000&quot;&gt;
				&lt;FONT COLOR=&quot;#FFFFFF&quot;&gt;Units Setting&lt;/FONT&gt;&lt;/TH&gt;
			&lt;TH ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#000000&quot;&gt;
				&lt;FONT COLOR=&quot;#FFFFFF&quot;&gt;Constant&lt;/FONT&gt;&lt;/TH&gt;
		&lt;/TR&gt;
		&lt;TR&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCCC&quot;&gt;Custom&lt;/TD&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCFF&quot;&gt;0&lt;/TD&gt;
		&lt;/TR&gt;
		&lt;TR&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCCC&quot;&gt;Feet/Inches&lt;/TD&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCFF&quot;&gt;1&lt;/TD&gt;
		&lt;/TR&gt;
		&lt;TR&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCCC&quot;&gt;Inches&lt;/TD&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCFF&quot;&gt;2&lt;/TD&gt;
		&lt;/TR&gt;
		&lt;TR&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCCC&quot;&gt;Feet&lt;/TD&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCFF&quot;&gt;3&lt;/TD&gt;
		&lt;/TR&gt;
		&lt;TR&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCCC&quot;&gt;Yards&lt;/TD&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCFF&quot;&gt;4&lt;/TD&gt;
		&lt;/TR&gt;
		&lt;TR&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCCC&quot;&gt;Miles&lt;/TD&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCFF&quot;&gt;5&lt;/TD&gt;
		&lt;/TR&gt;
		&lt;TR&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCCC&quot;&gt;Microns&lt;/TD&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCFF&quot;&gt;6&lt;/TD&gt;
		&lt;/TR&gt;
		&lt;TR&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCCC&quot;&gt;Millimeters&lt;/TD&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCFF&quot;&gt;7&lt;/TD&gt;
		&lt;/TR&gt;
		&lt;TR&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCCC&quot;&gt;Centimeters&lt;/TD&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCFF&quot;&gt;8&lt;/TD&gt;
		&lt;/TR&gt;
		&lt;TR&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCCC&quot;&gt;Meters&lt;/TD&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCFF&quot;&gt;9&lt;/TD&gt;
		&lt;/TR&gt;
		&lt;TR&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCCC&quot;&gt;Kilometers&lt;/TD&gt;
			&lt;TD ALIGN=&quot;CENTER&quot; BGCOLOR=&quot;#CCCCFF&quot;&gt;10&lt;/TD&gt;
		&lt;/TR&gt;
	&lt;/TABLE&gt;
&lt;/CENTER&gt;
&lt;BR&gt;

```pascal
PROCEDURE Units(i : INTEGER);
```

```python

def vs.Units(i):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|i|INTEGER|Standard units setting index value.|

## Version
Availability: from MiniCAD
## Category
* Units